app/controllers/carts_controller.rb

  def show
    begin
      @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 980190962 LIMIT 1

  def edit
    @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 980190962 LIMIT 1

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2012-08-10 22:03:05', '2012-08-10 22:03:05')

  def update
    @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 980190962 LIMIT 1

 def destroy
    @cart = current_cart
    @cart.destroy
---
DELETE FROM `carts` WHERE `carts`.`id` = 980190962