app/controllers/line_items_controller.rb

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
---
  def show
    @line_item = LineItem.find(params[:id])

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
---
  def edit
    @line_item = LineItem.find(params[:id])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 207281424 LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2012-08-10 22:03:05', '2012-08-10 22:03:05')
INSERT INTO `line_items` (`cart_id`, `created_at`, `product_id`, `quantity`, `updated_at`) VALUES (980190964, '2012-08-11 21:55:26', 207281424, 1, '2012-08-11 21:55:26')
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    respond_to do |format|
      if @line_item.save

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
---
  def update
    @line_item = LineItem.find(params[:id])

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
DELETE FROM `line_items` WHERE `line_items`.`id` = 980190962
---
  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy