app/controllers/products_controller.rb

  def index
    @products = Product.search(params[:search], params[:page])
---
SELECT `products`.* FROM `products` WHERE (name like '%%') ORDER BY name LIMIT 5 OFFSET 0

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`birthday`, `count`, `created_at`, `image_url`, `name`, `poem`, `price`, `updated_at`) VALUES ('August, 9, 2012', 1, '2012-08-10 15:45:04', 'lorem.jpg', 'Lorem Ipsum', 'Wibbles are fun!', 19.95, '2012-08-10 15:45:04')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 LIMIT 1
UPDATE `products` SET `name` = 'Lorem Ipsum', `birthday` = 'August, 9, 2012', `poem` = 'Wibbles are fun!', `image_url` = 'lorem.jpg', `price` = 19.95, `updated_at` = '2012-08-09 09:00:51' WHERE `products`.`id` = 980190962