app/controllers/store_controller.rb

  def index
    @products = Product.search(params[:search], params[:page])
---
SELECT `products`.* FROM `products` WHERE (name like '%%') ORDER BY name LIMIT 5 OFFSET 0